Ran Plan for dir: `ec2-jenkins` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.jenkins_igw will be created
+ resource "aws_internet_gateway" "jenkins_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + vpc_id   = "vpc-0f4a80280e769e28f"
    }

  # aws_route.jenkins_routetointernet will be created
+ resource "aws_route" "jenkins_routetointernet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.jenkins_rt will be created
+ resource "aws_route_table" "jenkins_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all         = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + vpc_id           = "vpc-0f4a80280e769e28f"
    }

  # aws_route_table_association.jenkins_pub_association will be created
+ resource "aws_route_table_association" "jenkins_pub_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-07bf29f5a6cdc49fb"
    }

  # local_file.ssh_key will be created
+ resource "local_file" "ssh_key" {
      + content              = (sensitive)
      + directory_permission = "700"
      + file_permission      = "400"
      + filename             = "./keys/key-key.pem"
      + id                   = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ec2-jenkins`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.patomagico.com.br/lock?id=antoniocivc%252Fprojeto-padawan%252Fec2-jenkins%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ec2-jenkins -- -var=key_name=key-key`
</details>
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
